# Все 5-буквенные слова, составленные из букв К,О,Л,А, записаны в алфавитном порядке. Вот начало списка:
#
# 1. ААААА
# 2. ААААК
# 3. ААААЛ
# 4. ААААО
# 5. АААКА
# .....
# Запишите слово, которое стоит под номером 423.

s = 'КОЛА'
i = 0
for c1 in sorted(s):
    for c2 in sorted(s):
        for c3 in sorted(s):
            for c4 in sorted(s):
                for c5 in sorted(s):
                    i += 1
                    t = c1 + c2 + c3 + c4 + c5
                    if i == 423:
                        print(i, t)
                        break